[
  {
    "id": "20260113_004926",
    "image_path": "D:/HerbalWin/assets/aloevera.png",
    "timestamp": "2026-01-13T00:49:26.562836",
    "response": "### Common Name (Philippine)\nSabila, Aloe Vera\n\n### Scientific Name\n*Aloe barbadensis miller*\n\n### Brief Description\nSabila is a succulent plant characterized by its thick, fleshy, lance-shaped leaves that grow in a rosette pattern. The leaves are typically green, often with white spots or streaks, and have serrated edges. A gel-like substance is found within the inner part of the leaves. It is a perennial plant that thrives in warm, dry climates and is commonly grown in pots or gardens.\n\n### Uses\nIn the Philippines, Sabila is widely used for its medicinal and cosmetic properties. The gel from its leaves is applied topically to treat burns, cuts, insect bites, and skin irritations. It is also used as a natural moisturizer for skin and hair. Some people consume the gel for its purported internal health benefits, though this is less common and requires careful preparation. It is also cultivated as an ornamental plant.\n\n### Health Benefits\nSabila is known for its soothing and healing properties. The gel contains compounds like polysaccharides and antioxidants that can help reduce inflammation, promote wound healing, and alleviate skin conditions such as eczema and psoriasis. It is also believed to have hydrating properties for the skin and can help soothe sunburn. Internally, it is sometimes used to aid digestion and boost the immune system, although scientific evidence for these uses is still developing.\n\n### Safety Notes\nWhile generally safe for topical use, some individuals may experience allergic reactions to Sabila. It is advisable to perform a patch test before widespread application. Ingesting Sabila can have laxative effects, and the latex layer between the skin and the gel should be avoided as it can cause stomach cramps and diarrhea. Pregnant or breastfeeding women, and individuals with certain medical conditions, should consult a healthcare professional before consuming Sabila. It is important to use fresh gel from the plant or commercially prepared products from reputable sources.",
    "success": true
  }
]